Agat/src/Catalogs/Контрагенты/Контрагенты.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Catalog>
  <name>Контрагенты</name>
  <attributes>
    <name>ПолноеНаименование</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>Адрес</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>ИНН</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>12</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>КПП</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>12</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ОГРН</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>15</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Телефон</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>Примечание</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>ЭлектроннаяПочта</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>10</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Тематика</name>
    <type>
      <types>CatalogRef.Тематика</types>
    </type>
  </attributes>
  <attributes>
    <name>Сотрудник</name>
    <type>
      <types>CatalogRef.Сотрудники</types>
    </type>
  </attributes>
  <tabularSections>
    <name>КонтактныеДанные</name>
    <attributes>
      <name>Подразделение</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>40</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ФИОСотрудника</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>30</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Телефон</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>30</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Примечание</name>
      <type>
        <types>String</types>
      </type>
    </attributes>
  </tabularSections>
  <tabularSections>
    <name>Архив</name>
    <attributes>
      <name>ВидДокумента</name>
      <type>
        <types>String</types>
      </type>
    </attributes>
    <attributes>
      <name>НаименованиеДокумента</name>
      <type>
        <types>String</types>
      </type>
    </attributes>
    <attributes>
      <name>НомерДокумента</name>
      <type>
        <types>String</types>
      </type>
    </attributes>
    <attributes>
      <name>ДатаДокумента</name>
      <type>
        <types>Date</types>
        <dateQualifiers>
          <dateFractions>Date</dateFractions>
        </dateQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Примечание</name>
      <type>
        <types>String</types>
      </type>
    </attributes>
    <attributes>
      <name>РасширениеФайла</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>10</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>УникальныйИдентификатор</name>
      <type>
        <types>UUID</types>
      </type>
    </attributes>
  </tabularSections>
</mdclass:Catalog>

Agat/src/Catalogs/Контрагенты/Forms/ФормаСписка/Module.bsl
///////////////////////////////////////////////////////////////////////////////////////////
// EXCEL //////////////////////////////////////////////////////////////////////////////////
/////////////////////////////////////////////////////////////////////////////////////////// 
// Универсальная загрузка данных из Excel  
// общий модуль - ЗагрузкаДанныхУниверсальная  
// общая форма - ДиалогНастройкиКолонок 
///////////////////////////////////////////////////////////////////////////////////////////  

 &НаКлиенте
Процедура ЗагрузитьИзExcel(Команда)
	Оповещение = Новый ОписаниеОповещения("ПослеВыбораФайла", ЭтотОбъект);
	Диалог = Новый ДиалогВыбораФайла(РежимДиалогаВыбораФайла.Открытие);
	Диалог.Фильтр = "Excel (*.xlsx)|*.xlsx";
	Диалог.Показать(Оповещение);
КонецПроцедуры

&НаКлиенте
Процедура ПослеВыбораФайла(ВыбранныеФайлы, ДополнительныеПараметры) Экспорт
	Если ВыбранныеФайлы = Неопределено Тогда Возврат; КонецЕсли;
	
	// Извлекаем путь (строку) из массива
	ЭтаФорма.ПутьКФайлу = ?(ТипЗнч(ВыбранныеФайлы) = Тип("Массив"), ВыбранныеФайлы[0], ВыбранныеФайлы);
	
	// ОПРЕДЕЛЯЕМ КОНКРЕТНЫЕ РЕКВИЗИТЫ ДЛЯ ЗАПОЛНЕНИЯ в коде
	СписокПолей = Новый СписокЗначений;
	//////////////////////////////////////////////////////////////////////////////
	СписокПолей.Добавить("Наименование", "Сокращенное наименование");           //
	СписокПолей.Добавить("ПолноеНаименование",          "Полное наименование"); //
	СписокПолей.Добавить("ИНН",         "ИНН");                                 //
	СписокПолей.Добавить("КПП",         "КПП");                                 //
	СписокПолей.Добавить("ОГРН",         "ОГРН");                               //
	СписокПолей.Добавить("Адрес",          "Адрес");                            //
	СписокПолей.Добавить("Телефон",          "Телефон");                        //
	СписокПолей.Добавить("ЭлектроннаяПочта",    "ЭлектроннаяПочта");            //
	СписокПолей.Добавить("Примечание",    "Примечание");	                    //
	//////////////////////////////////////////////////////////////////////////////	
	ПараметрыДиалога = Новый Структура;
	ПараметрыДиалога.Вставить("СписокПолей",    СписокПолей);
	ПараметрыДиалога.Вставить("СписокЛистов",   ЗагрузкаДанныхСервер.ПолучитьСписокЛистов(ЭтаФорма.ПутьКФайлу));
	//////////////////////////////////////////////////////////////////////////////
	ПараметрыДиалога.Вставить("ИмяСправочника", "Контрагенты");                 //
    //////////////////////////////////////////////////////////////////////////////
	
	// Открытие ОТДЕЛЬНОГО БЛОКИРУЮЩЕГО ОКНА
	ОповещениеЗакрытия = Новый ОписаниеОповещения("ПослеНастройки", ЭтотОбъект);
	ОткрытьФорму("ОбщаяФорма.ДиалогНастройкиКолонок", 
	             ПараметрыДиалога, 
	             ЭтотОбъект, 
	             Истина, // Уникальность
	             , 
	             , 
	             ОповещениеЗакрытия, 
	             РежимОткрытияОкнаФормы.БлокироватьВесьИнтерфейс);
КонецПроцедуры

&НаКлиенте
Процедура ПослеНастройки(Результат, ДополнительныеПараметры) Экспорт
	Если Результат = Неопределено Тогда Возврат; КонецЕсли;

	Попытка
		Лог = ЗагрузкаДанныхСервер.ЗагрузитьДанные(
			Неопределено, 
			ЭтаФорма.ПутьКФайлу, 
			Результат.НастройкиКолонок, 
			Результат.СтартоваяСтрока, 
			Результат.КонечнаяСтрока, 
			Результат.ИмяСправочника, 
			Результат.ИмяЛиста
		);
		Элементы.Список.Обновить();
		
		        // Лог.ПоследняяСсылка определена на сервере модуль - ЗагрузкаДанныхСервер
		        Если Лог.ПоследняяСсылка <> Неопределено Тогда
		            Элементы.Список.ТекущаяСтрока = Лог.ПоследняяСсылка;
		        КонецЕсли;		
		
		ПоказатьОповещениеПользователя("Загрузка завершена", , "Успешно: " + Лог.Успешно);
	Исключение
		Сообщить(ОписаниеОшибки());
	КонецПопытки;
КонецПроцедуры
 ///////////////////////////////////////////////////////////////////////////////////////////
 ///////////////////////////////////////////////////////////////////////////////////////////
